report.example/oltp_point_select_8threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 188910.27 qps: 188910.27 (r/w/o: 188910.27/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 8 tps: 186767.20 qps: 186767.20 (r/w/o: 186767.20/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 8 tps: 188271.19 qps: 188271.19 (r/w/o: 188271.19/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 8 tps: 191519.35 qps: 191519.35 (r/w/o: 191519.35/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 8 tps: 189043.71 qps: 189043.71 (r/w/o: 189043.71/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 190581.13 qps: 190582.13 (r/w/o: 190582.13/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 8 tps: 189539.34 qps: 189538.34 (r/w/o: 189538.34/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 8 tps: 187161.82 qps: 187161.82 (r/w/o: 187161.82/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 188462.13 qps: 188462.13 (r/w/o: 188462.13/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 189099.98 qps: 189099.98 (r/w/o: 189099.98/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 8 tps: 188344.84 qps: 188344.84 (r/w/o: 188344.84/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 186315.25 qps: 186315.25 (r/w/o: 186315.25/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 8 tps: 186313.67 qps: 186313.67 (r/w/o: 186313.67/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 8 tps: 185867.67 qps: 185867.67 (r/w/o: 185867.67/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 185889.17 qps: 185889.17 (r/w/o: 185889.17/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 8 tps: 185783.13 qps: 185783.13 (r/w/o: 185783.13/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 8 tps: 185536.71 qps: 185536.71 (r/w/o: 185536.71/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 185383.29 qps: 185383.29 (r/w/o: 185383.29/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 8 tps: 184758.92 qps: 184758.92 (r/w/o: 184758.92/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 185779.46 qps: 185780.46 (r/w/o: 185780.46/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 184288.30 qps: 184287.30 (r/w/o: 184287.30/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 8 tps: 186042.51 qps: 186042.51 (r/w/o: 186042.51/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 8 tps: 185851.32 qps: 185851.32 (r/w/o: 185851.32/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 8 tps: 185465.51 qps: 185465.51 (r/w/o: 185465.51/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 185755.95 qps: 185755.95 (r/w/o: 185755.95/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 8 tps: 183968.81 qps: 183968.81 (r/w/o: 183968.81/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 8 tps: 184763.89 qps: 184763.89 (r/w/o: 184763.89/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 8 tps: 186784.35 qps: 186784.35 (r/w/o: 186784.35/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 8 tps: 185874.27 qps: 185874.27 (r/w/o: 185874.27/0.00/0.00) lat (ms,95%): 0.05 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            5605188
        write:                           0
        other:                           0
        total:                           5605188
    transactions:                        5605188 (186823.75 per sec.)
    queries:                             5605188 (186823.75 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0015s
    total number of events:              5605188

Latency (ms):
         min:                                    0.03
         avg:                                    0.04
         max:                                    2.38
         95th percentile:                        0.05
         sum:                               238979.01

Threads fairness:
    events (avg/stddev):           700648.5000/33811.85
    execution time (avg/stddev):   29.8724/0.00